In [100]:
import pandas as pd

# Series

In [101]:
data = [1, 2, 3, 4, 5]

In [102]:
s = pd.Series(data)

In [103]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [104]:
index = ['Linha' + str(i) for i in range(5)]

In [105]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [106]:
s = pd.Series(data = data, index = index)

In [107]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [108]:
data = {'Linha' + str(i) : i + 1 for i in range(5)}

In [109]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [110]:
s = pd.Series(data)

In [111]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [112]:
s1 = s + 2

In [113]:
s1   #soma 2 em todas as linhas

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [114]:
s2 = s + s1

In [115]:
s2   # soma de s e s1

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# DataFrame

In [116]:
data = [[1,2,3], [4,5,6], [7,8,9]]

In [117]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [118]:
df1 = pd.DataFrame(data)

In [119]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [120]:
index = ['Linha' + str(i) for i in range(3)] # criando rótulos para linhas

In [121]:
index

['Linha0', 'Linha1', 'Linha2']

In [122]:
df1 = pd.DataFrame(data = data, index = index)

In [123]:
columns = ['Coluna' + str(i) for i in range(3)] # criando rótulos para colunas

In [124]:
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [125]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [126]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

## DataFrame com dicionário

In [127]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
         'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8}, 
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [128]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [129]:
df2 = pd.DataFrame(data)

In [130]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

## DataFrames com lista de Tuplas

In [131]:
data = [(1,2,3), (4,5,6), (7,8,9)]

In [132]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [133]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

## Concatenando DataFrames

In [134]:
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [135]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [136]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [137]:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [138]:
df4 = pd.concat([df1, df2, df3], axis = 1) # concatena um ao lado do outro
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C